olliw42/stm32ll-lib/src/stdstm32-uartc.h
//*******************************************************
// Copyright (c) OlliW, OlliW42, www.olliw.eu
// GPL3
// https://www.gnu.org/licenses/gpl-3.0.de.html
//*******************************************************
// my stripped down UART standard library
// only ISR, no DMA, no wait and tmo rx functions, no convenience functions
//*******************************************************
// Interface:
//
// #define UARTC_USE_UART1, UARTC_USE_UART2, UARTC_USE_UART3, UARTC_USE_UART3_REMAPPED, UARTC_USE_UART4, UARTC_USE_UART5
// #define UARTC_USE_LPUART1, UARTC_USE_LPUART1_REMAPPED
// 
// #define UARTC_BAUD
//
// #define UARTC_USE_TX
// #define UARTC_TXBUFSIZE
// #define UARTC_USE_TX_ISR
// #define UARTC_USE_TX_DMA
//
// #define UARTC_USE_RX
// #define UARTC_RXBUFSIZE
//
// #define UARTC_IRQ_PRIORITY
//
// #define UARTC_USE_RXERRORCOUNT
//
// #define UARTC_RX_CALLBACK_FULL(c)
// #define UARTC_TC_CALLBACK() // ATTENTION: when used, one never should trigger TC isr without a byte written to the tx buffer
//
//*******************************************************
#ifndef STDSTM32_UARTC_H
#define STDSTM32_UARTC_H
#ifdef __cplusplus
extern "C" {
#endif


//-------------------------------------------------------
// Enums
//-------------------------------------------------------
// in order to not introduce hardware dependency upstream
// we define our own enums for parity and stopbits

#ifndef UART_ENUMS
#define UART_ENUMS

typedef enum {
  XUART_PARITY_NO = LL_USART_PARITY_NONE, // XUART_xxx to avoid overlap with HAL
  XUART_PARITY_EVEN = LL_USART_PARITY_EVEN,
  XUART_PARITY_ODD = LL_USART_PARITY_ODD,
  XUART_PARITY_MAKEITU32 = UINT32_MAX,
} UARTPARITYENUM;

typedef enum {
  UART_STOPBIT_0_5 = LL_USART_STOPBITS_0_5,
  UART_STOPBIT_1 = LL_USART_STOPBITS_1,
  UART_STOPBIT_1_5 = LL_USART_STOPBITS_1_5,
  UART_STOPBIT_2 = LL_USART_STOPBITS_2,
  UART_STOPBIT_MAKEITU32 = UINT32_MAX,
} UARTSTOPBITENUM;

#endif


//-------------------------------------------------------
// Defines
//-------------------------------------------------------

#include "stdstm32-peripherals.h"

#if (defined UARTC_USE_TX_ISR) && (!defined UARTC_USE_TX)
  #error UARTC_USE_TX_ISR used without UARTC_USE_TX!
#endif
#if (defined UARTC_USE_RXERRORCOUNT) && (!defined UARTC_USE_RX)
  #error UARTC_USE_RXERRORCOUNT used without UARTC_USE_RX!
#endif

#ifdef UARTC_USE_TX_DMA
  #error UARTC_USE_TX_DMA not supported by this library!
#endif


#ifndef UARTC_BAUD
  #define UARTC_BAUD             115200UL // 9600UL
#endif


#ifdef UARTC_USE_TX_ISR
  #ifndef UARTC_TXBUFSIZE
    #define UARTC_TXBUFSIZE      256 // MUST be 2^N
  #endif
  #if UARTC_TXBUFSIZE < 2
    #error UARTC_TXBUFSIZE must be larger than 1 !
  #elif ((UARTC_TXBUFSIZE & (UARTC_TXBUFSIZE-1)) != 0)
    #error UARTC_TXBUFSIZE must be a power of 2 !
  #endif

  #define UARTC_TXBUFSIZEMASK  (UARTC_TXBUFSIZE-1)

  volatile char uartc_txbuf[UARTC_TXBUFSIZE];
  volatile uint16_t uartc_txwritepos; // pos at which the last byte was stored
  volatile uint16_t uartc_txreadpos; // pos at which the next byte is to be fetched
#endif


#ifdef UARTC_USE_RX
  #ifndef UARTC_RXBUFSIZE
    #define UARTC_RXBUFSIZE      256 //128 //MUST be 2^N
  #endif
  #if UARTC_RXBUFSIZE < 2
    #error UARTC_RXBUFSIZE must be larger than 1 !
  #elif ((UARTC_RXBUFSIZE & (UARTC_RXBUFSIZE-1)) != 0)
    #error UARTC_RXBUFSIZE must be a power of 2 !
  #endif

  #define UARTC_RXBUFSIZEMASK  (UARTC_RXBUFSIZE-1)

  volatile char uartc_rxbuf[UARTC_RXBUFSIZE];
  volatile uint16_t uartc_rxwritepos; // pos at which the last byte was stored
  volatile uint16_t uartc_rxreadpos; // pos at which the next byte is to be fetched

  #ifdef UARTC_USE_RXERRORCOUNT
  volatile uint32_t uartc_errorcnt_rxnoise;
  volatile uint32_t uartc_errorcnt_rxframe;
  volatile uint32_t uartc_errorcnt_rxoverrun;
  #endif
#endif


#if defined UARTC_USE_UART1 || defined UARTC_USE_UART1_REMAPPED || defined UARTC_USE_UART1_REMAPPED2
  #define UARTC_UARTx             USART1
  #ifdef UARTC_USE_UART1
    #define UARTC_TX_IO           IO_PA9
    #define UARTC_RX_IO           IO_PA10
  #elif defined UARTC_USE_UART1_REMAPPED
    #define UARTC_TX_IO           IO_PB6
    #define UARTC_RX_IO           IO_PB7
  #elif defined UARTC_USE_UART1_REMAPPED2 // only G4
    #define UARTC_TX_IO           IO_PC4 // on G4
    #define UARTC_RX_IO           IO_PC5
  #endif
  #define UARTC_IO_AF             IO_AF_7
  #define UARTC_IRQn              USART1_IRQn
  #define UARTC_IRQHandler        USART1_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #endif

#elif defined UARTC_USE_UART2 || defined UARTC_USE_UART2_REMAPPED || defined UARTC_USE_UART2_REMAPPED2 || defined UARTC_USE_UART2_REMAPPED3
  #define UARTC_UARTx             USART2
  #ifdef UARTC_USE_UART2
    #define UARTC_TX_IO           IO_PA2
    #define UARTC_RX_IO           IO_PA3
  #elif defined UARTC_USE_UART2_REMAPPED
    #define UARTC_TX_IO           IO_PD5
    #define UARTC_RX_IO           IO_PD6
  #elif defined UARTC_USE_UART2_REMAPPED2 // only G4
    #define UARTC_TX_IO           IO_PB3
    #define UARTC_RX_IO           IO_PB4
  #elif defined UARTC_USE_UART2_REMAPPED3 // only G4 // ATTENTION: PA14 overlaps with SWCLK
    #define UARTC_TX_IO           IO_PA14
    #define UARTC_RX_IO           IO_PA15
  #endif
  #define UARTC_IO_AF             IO_AF_7
  #define UARTC_IRQn              USART2_IRQn
  #define UARTC_IRQHandler        USART2_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #endif

#elif defined UARTC_USE_UART3 || defined UARTC_USE_UART3_REMAPPED
  #define UARTC_UARTx             USART3
  #if defined UARTC_USE_UART3 && defined STM32F3
    #define UARTC_TX_IO           IO_PB8
    #define UARTC_RX_IO           IO_PB9
  #elif defined UARTC_USE_UART3
    #define UARTC_TX_IO           IO_PB10
    #define UARTC_RX_IO           IO_PB11
  #else
    #define UARTC_TX_IO           IO_PC10
    #define UARTC_RX_IO           IO_PC11
  #endif
  #define UARTC_IO_AF             IO_AF_7
  #define UARTC_IRQn              USART3_IRQn
  #define UARTC_IRQHandler        USART3_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #endif

#elif defined UARTC_USE_UART4 || defined UARTC_USE_UART4_REMAPPED
  #define UARTC_UARTx             UART4
  #ifdef UARTC_USE_UART4
    #define UARTC_TX_IO           IO_PC10
    #define UARTC_RX_IO           IO_PC11
  #else
    #define UARTC_TX_IO           IO_PA0 // only F7 !
    #define UARTC_RX_IO           IO_PA1
  #endif
  #define UARTC_IRQn              UART4_IRQn
  #define UARTC_IRQHandler        UART4_IRQHandler
  #if defined STM32F1
    #define UARTC_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UARTC IO_AF & DMA for F3 still TODO
  #elif defined STM32F7
    #define UARTC_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTC_IO_AF           IO_AF_5
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UARTC_USE_UART5
  #define UARTC_UARTx             UART5
  #define UARTC_TX_IO             IO_PC12
  #define UARTC_RX_IO             IO_PD2
  #define UARTC_IRQn              UART5_IRQn
  #define UARTC_IRQHandler        UART5_IRQHandler
  #if defined STM32F1
    #define UARTC_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UARTC IO_AF & DMA for F3 still TODO //TODO
  #elif defined STM32F7
    #define UARTC_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTC_IO_AF           IO_AF_5
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UARTC_USE_UART6 || defined UARTC_USE_UART6_REMAPPED
  #define UARTC_UARTx             USART6
  #ifdef UARTC_USE_UART6
    #define UARTC_TX_IO           IO_PC6
    #define UARTC_RX_IO           IO_PC7
  #else
    #define UARTC_TX_IO           IO_PG14
    #define UARTC_RX_IO           IO_PG9
  #endif
  #define UARTC_IO_AF             IO_AF_8
  #define UARTC_IRQn              USART6_IRQn
  #define UARTC_IRQHandler        USART6_IRQHandler
  #if defined STM32F1 || defined STM32F3 || defined STM32G4
    #error UART6 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UARTC_USE_UART7 || defined UARTC_USE_UART7_REMAPPED
  #define UARTC_UARTx             UART7
  #ifdef UARTC_USE_UART7
    #define UARTC_TX_IO           IO_PE8
    #define UARTC_RX_IO           IO_PE7
  #else
    #define UARTC_TX_IO           IO_PF7
    #define UARTC_RX_IO           IO_PF6
  #endif
  #define UARTC_IO_AF             IO_AF_8
  #define UARTC_IRQn              UART7_IRQn
  #define UARTC_IRQHandler        UART7_IRQHandler
  #if defined STM32F1 || defined STM32F3 || defined STM32G4
    #error UART7 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UARTC_USE_UART8
  #define UARTC_UARTx             UART8
  #define UARTC_TX_IO             IO_PE1
  #define UARTC_RX_IO             IO_PE0
  #define UARTC_IO_AF             IO_AF_8
  #define UARTC_IRQn              UART8_IRQn
  #define UARTC_IRQHandler        UART8_IRQHandler
  #if defined STM32F1 || defined STM32F3 || defined STM32G4
    #error UART8 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UARTC_USE_LPUART1 || defined UARTC_USE_LPUART1_REMAPPED
  #define UARTC_UARTx             LPUART1
  #ifdef UARTC_USE_LPUART1
    #define UARTC_TX_IO           IO_PA2
    #define UARTC_RX_IO           IO_PA3
  #elif defined UARTC_USE_LPUART1_REMAPPED
    #define UARTC_TX_IO           IO_PC1
    #define UARTC_RX_IO           IO_PC0
  #endif
  #define UARTC_IO_AF             IO_AF_12
  #define UARTC_IRQn              LPUART1_IRQn
  #define UARTC_IRQHandler        LPUART1_IRQHandler
  #if defined STM32F1 || defined STM32F3 || defined STM32F7
    #error UART8 NOT AVAILABLE !
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#else
  #error No UARTC_USE_UARTx defined!
#endif


//-------------------------------------------------------
// COMMENT:
// LL_USART_XX and LL_LPUART_XX flags are just redefines of USART_XX flags.
// So, we can use USART_XX here and below.
// This has also the advantage that it works for both USART and LPUART.
//
// Also, both USART and LPUART use the same structure USART_TypeDef.
// All LL_USART_xx() and LL_LPUART_xx() functions which only use it and relate to flags or 
// registers can be used for both USART and LPUART. 
// Below we simply use the LL_USART_xx() functions for both.


//-------------------------------------------------------
// Glue macros
//-------------------------------------------------------

#if defined STM32F1
  #define REG_DR        DR
  #define REG_SR        SR
  #define FLAG_SR_RXNE  USART_SR_RXNE
  #define FLAG_SR_ORE   USART_SR_ORE
  #define FLAG_SR_NE    USART_SR_NE
  #define FLAG_SR_FE    USART_SR_FE
  #define FLAG_SR_TXE   USART_SR_TXE
  #define FLAG_SR_TC    USART_SR_TC
#elif defined STM32F3 || defined STM32F7 || defined STM32L4
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  USART_ISR_RXNE
  #define FLAG_SR_ORE   USART_ISR_ORE
  #define FLAG_SR_NE    USART_ISR_NE
  #define FLAG_SR_FE    USART_ISR_FE
  #define FLAG_SR_TXE   USART_ISR_TXE
  #define FLAG_SR_TC    USART_ISR_TC
#elif defined STM32G4
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  USART_ISR_RXNE_RXFNE
  #define FLAG_SR_ORE   USART_ISR_ORE
  #define FLAG_SR_NE    USART_ISR_NE
  #define FLAG_SR_FE    USART_ISR_FE
  #define FLAG_SR_TXE   USART_ISR_TXE_TXFNF
  #define FLAG_SR_TC    USART_ISR_TC
#endif


//-------------------------------------------------------
// ISR routine
//-------------------------------------------------------
#if defined UARTC_USE_RX || defined UARTC_USE_TX_ISR

void UARTC_IRQHandler(void)
{
  // Cube HAL for f103rc is also calling this first independent on irqs
  uint16_t usart_sr = LL_USART_ReadReg(UARTC_UARTx, REG_SR); // read USART_SR register

#ifdef UARTC_USE_RX
  if (usart_sr & FLAG_SR_RXNE) {
#ifdef UARTC_USE_RXERRORCOUNT
    if (usart_sr & FLAG_SR_ORE) uartc_errorcnt_rxoverrun++;
    if (usart_sr & FLAG_SR_NE) uartc_errorcnt_rxnoise++;
    if (usart_sr & FLAG_SR_FE) uartc_errorcnt_rxframe++;
#endif
    // Cube LL driver (for f103?) says that reading SR and then writing to DR will clear error flags, so do it after error checks
    uint8_t usart_dr = LL_USART_ReceiveData8(UARTC_UARTx); // read USART_DR register, clears RXNE and RX error flags
#ifdef UARTC_RX_CALLBACK_FULL
    UARTC_RX_CALLBACK_FULL(usart_dr);
#else
    uint16_t next = (uartc_rxwritepos + 1) & UARTC_RXBUFSIZEMASK;
    if (uartc_rxreadpos != next) { // fifo not full
      uartc_rxbuf[next] = usart_dr;
      uartc_rxwritepos = next;
    }
#endif
  }
#if defined STM32F1
  // ORE is enabled along with RXNE, so we need to handle it
  // ORE bit is reset by read to USART_SR followed by read to USART_DR
  if (usart_sr & FLAG_SR_ORE) {
    LL_USART_ReceiveData8(UARTC_UARTx); // read USART_DR register, clears RXNE and RX error flags
  }
#elif defined STM32F3
  #warning UARTC F3 check clear flags, should be LL !?
  // ORE is enabled along with RXNE, but can be cleared by writing 1 to ICR
  LL_USART_WriteReg(UARTC_UARTx, ICR, (USART_ICR_ORECF | USART_ICR_NCF | USART_ICR_FECF | USART_ICR_PECF | USART_ICR_IDLECF));
#elif defined STM32F7
  #warning UARTC F7 check clear flags, should be LL !?
  // these are cleared by write 1 to the ICR register, not by a read of DR register!
  LL_USART_WriteReg(UARTC_UARTx, ICR, (USART_ICR_IDLECF | USART_ICR_ORECF | USART_ICR_NCF | USART_ICR_FECF | USART_ICR_PECF));
#elif defined STM32G4
  LL_USART_WriteReg(UARTC_UARTx, ICR, (USART_ICR_IDLECF | USART_ICR_ORECF | USART_ICR_NECF | USART_ICR_FECF | USART_ICR_PECF));
#elif defined STM32L4
  #warning UARTC L4 check clear flags, should be LL !?
  LL_USART_WriteReg(UARTC_UARTx, ICR, (USART_ICR_IDLECF | USART_ICR_ORECF | USART_ICR_NECF | USART_ICR_FECF | USART_ICR_PECF));
#endif
#endif

#ifdef UARTC_USE_TX_ISR
  if (usart_sr & FLAG_SR_TXE) {
    if (uartc_txwritepos != uartc_txreadpos) { // fifo not empty
      uartc_txreadpos = (uartc_txreadpos + 1) & UARTC_TXBUFSIZEMASK;
      LL_USART_TransmitData8(UARTC_UARTx, uartc_txbuf[uartc_txreadpos]); // write to USART_DR register, clears TXE flag, as well as TC
    } else {
      LL_USART_DisableIT_TXE(UARTC_UARTx); // disable interrupt when empty
#ifdef UARTC_TC_CALLBACK
      // ATTENTION: doesn't distinguish between empty fifo and last byte just send!
      LL_USART_ClearFlag_TC(UARTC_UARTx); // now enable TC interrupt
      LL_USART_EnableIT_TC(UARTC_UARTx);
#endif
    }
  }

#ifdef UARTC_TC_CALLBACK
  if (usart_sr & FLAG_SR_TC) {
    LL_USART_DisableIT_TC(UARTC_UARTx);
    LL_USART_ClearFlag_TC(UARTC_UARTx);
    UARTC_TC_CALLBACK();
  }
#endif
#endif
}

